[
  {
    "team": [
      "abra",
      "fearow",
      "sawk",
      "drifblim",
      "sawk",
      "abra"
    ],
    "roast": "Are you seriously running this in National Dex (All)? This looks like something a ten-year-old cooked up from their first playthrough. You've got *two* Abras. Not Alakazams, not even Kadabras, but *Abras*. They have the bulk of a wet tissue and get OHKO'd by literally anything that breathes in this meta. Fearow is an absolute joke; it's outclassed by every other bird in existence and brings nothing to the table but a guaranteed free switch for your opponent. Then you have *two* Sawks, proving you either forgot what you put on your team or genuinely believe a frail, outsped Fighting-type with no niche in a world of Urshifu, Marshadow, and Zamazenta is a good idea. And Drifblim? Its only purpose is to die to Stealth Rock and then get swept by any competent attacker. This team has no hazard control, no reliable special attacker (unless your Abra is packing some secret Nuke that I'm unaware of), no actual bulk, and no answers for anything that matters. Dragapult, Calyrex-S, Eternatus, even a mildly annoyed Corviknight would wipe this entire squad. This isn't a team; it's a collection of 'mons begging to be deleted from the PC. You'd lose to a single Ferrothorn.",
    "worst_pokemon": "abra"
  },
  {
    "team": [
      "feraligatr-mega",
      "corsola-galar",
      "zarude-dada",
      "maushold-family-of-four",
      "drifblim",
      "shiftry"
    ],
    "roast": "⚠️ DEPLOYMENT DEBUG INFO: [gemini-1.5-flash Error]: 404 models/gemini-1.5-flash is not found for API version v1beta, or is not supported for generateContent. Call ListModels to see the list of available models and their supported methods. || [gemini-1.5-pro Error]: 404 models/gemini-1.5-pro is not found for API version v1beta, or is not supported for generateContent. Call ListModels to see the list of available models and their supported methods.",
    "worst_pokemon": "System Failure"
  },
  {
    "team": [
      "feraligatr-mega",
      "charizard",
      "lucario",
      "garchomp",
      "dratini",
      "jolteon"
    ],
    "roast": "⚠️ DEPLOYMENT DEBUG INFO: [gemini-1.5-flash Error]: 404 models/gemini-1.5-flash is not found for API version v1beta, or is not supported for generateContent. Call ListModels to see the list of available models and their supported methods. || [gemini-1.5-pro Error]: 404 models/gemini-1.5-pro is not found for API version v1beta, or is not supported for generateContent. Call ListModels to see the list of available models and their supported methods.",
    "worst_pokemon": "System Failure"
  },
  {
    "team": [
      "feraligatr-mega",
      "charizard-mega-x",
      "jolteon",
      "garchomp",
      "lucario",
      "dragonair"
    ],
    "roast": "⚠️ DEPLOYMENT DEBUG INFO: [gemini-1.5-flash Error]: 404 models/gemini-1.5-flash is not found for API version v1beta, or is not supported for generateContent. Call ListModels to see the list of available models and their supported methods. || [gemini-1.5-pro Error]: 404 models/gemini-1.5-pro is not found for API version v1beta, or is not supported for generateContent. Call ListModels to see the list of available models and their supported methods.",
    "worst_pokemon": "System Failure"
  },
  {
    "team": [
      "feraligatr-mega",
      "charizard-mega-x",
      "jolteon",
      "dragonair",
      "lucario",
      "garchomp"
    ],
    "roast": "⚠️ DEPLOYMENT DEBUG INFO: [models/gemini-1.5-flash Error]: 404 models/gemini-1.5-flash is not found for API version v1beta, or is not supported for generateContent. Call ListModels to see the list of available models and their supported methods. || [models/gemini-1.5-pro Error]: 404 models/gemini-1.5-pro is not found for API version v1beta, or is not supported for generateContent. Call ListModels to see the list of available models and their supported methods.",
    "worst_pokemon": "System Failure"
  },
  {
    "team": [
      "feraligatr-mega",
      "charizard-mega-x",
      "dragonair",
      "lucario",
      "jolteon",
      "garchomp"
    ],
    "roast": "⚠️ DEPLOYMENT DEBUG INFO: [models/gemini-2.5-flash Error]: 429 You exceeded your current quota, please check your plan and billing details. For more information on this error, head to: https://ai.google.dev/gemini-api/docs/rate-limits. To monitor your current usage, head to: https://ai.dev/usage?tab=rate-limit. \n* Quota exceeded for metric: generativelanguage.googleapis.com/generate_content_free_tier_requests, limit: 20, model: gemini-2.5-flash\nPlease retry in 59.539881145s. [links {\n  description: \"Learn more about Gemini API quotas\"\n  url: \"https://ai.google.dev/gemini-api/docs/rate-limits\"\n}\n, violations {\n  quota_metric: \"generativelanguage.googleapis.com/generate_content_free_tier_requests\"\n  quota_id: \"GenerateRequestsPerDayPerProjectPerModel-FreeTier\"\n  quota_dimensions {\n    key: \"model\"\n    value: \"gemini-2.5-flash\"\n  }\n  quota_dimensions {\n    key: \"location\"\n    value: \"global\"\n  }\n  quota_value: 20\n}\n, retry_delay {\n  seconds: 59\n}\n] || [models/gemini-1.5-flash Error]: 404 models/gemini-1.5-flash is not found for API version v1beta, or is not supported for generateContent. Call ListModels to see the list of available models and their supported methods. || [models/gemini-pro Error]: 404 models/gemini-pro is not found for API version v1beta, or is not supported for generateContent. Call ListModels to see the list of available models and their supported methods.",
    "worst_pokemon": "System Failure"
  },
  {
    "team": [
      "feraligatr-mega",
      "charizard-mega-x",
      "jolteon",
      "garchomp",
      "lucario",
      "dragonair"
    ],
    "roast": "Oh, *National Dex (All)*, you say? More like 'National Dex (All My Brain Cells Are Dead)'. First off, let's address the elephant in the room – or should I say, the two elephants trying to squeeze into a one-elephant circus: you can only have *one* Mega Evolution per battle. Picking both Charizard-Mega-X AND a Pokémon that doesn't even exist, 'Mega Feraligatr,' isn't just an amateur mistake; it's a testament to your utter cluelessness about basic competitive rules. Did you think you could just manifest a new Mega into existence? And speaking of manifesting, how about you manifest some actual competitive Pokémon instead of *Dragonair*? Seriously, in a format where Zacian-Crowned, Primal Groudon, and Geomancy Xerneas run rampant, you brought a pre-evolutionary noodle. Were you hoping it would evolve mid-battle by sheer willpower? Because it's going to get obliterated before it can even shed a tear. The rest of your team isn't much better. Charizard-X, Garchomp, Lucario... they're all perfectly fine *if* you were playing OU ten years ago, but here? They're glorified speed bumps for anything with a Pulse or a Moonblast. Your entire team looks like it stumbled out of a bad fanfiction, completely devoid of hazard control, defensive synergy, or any viable way to deal with the actual threats in National Dex (All). You'll be lucky to get a single KO before your team gets swept faster than you can say 'What's a Zacian?' It's not a team; it's a collection of missed opportunities and fundamental misunderstandings, topped off with a non-existent Mega and a Pokémon that belongs in a petting zoo, not a competitive battlefield.",
    "worst_pokemon": "Dragonair"
  },
  {
    "team": [
      "feraligatr",
      "jolteon",
      "charizard-mega-x",
      "lucario",
      "dragonair",
      "garchomp"
    ],
    "roast": "Are you even serious right now? National Dex (All) is a cesspool of the most broken Pokémon ever conceived, packing Z-moves, Terastallization, and Mega Evolutions that hit like trucks, and you're seriously bringing a *Dragonair*? What, did you forget where the Rare Candies were? This isn't some casual playthrough where you can walk through the Distortion World with unevolved Pokémon; this is where Calyrex-Shadow and Zacian-Crowned run free. Your Dragonair is going to be setup fodder for literally anything that breathes, getting knocked out by Stealth Rock damage alone before it even dares to move. You'll make Wattson's Magnemite look like a world-ending threat compared to how fast that thing will die. Feraligatr and Jolteon? Bless your heart, they're so outclassed by almost every other water or electric type in the format they might as well be holding 'Please Faint' signs. Charizard-X and Garchomp are solid, but they can't carry this entire team of dead weight. You've essentially entered a Pokémon World Championship with three starters and two actual competitive threats. You're not going to beat a single Tera Raid with this, let alone a half-decent opponent. Go back to basics, understand what a fully evolved Pokémon is, and maybe then try to actually build a team.",
    "worst_pokemon": "Dragonair"
  },
  {
    "team": [
      "feraligatr",
      "jolteon",
      "garchomp",
      "charizard-mega-x",
      "dragonair",
      "lucario"
    ],
    "roast": "Oh, *this* is your National Dex team? Did you accidentally hit 'Randomize Team' and then forget to evolve anything? This isn't a team; it's a collection of missed opportunities and outright trolling. If you brought this abomination into the Distortion World, Giratina would send you back to Hearthome City himself just to spare you the embarrassment. Feraligatr and Jolteon are doing their best to pretend it's still Gen 4, while your Lucario and Garchomp are good Pokémon shackled by the rest of this mediocrity. Mega Charizard X is the only thing truly salvaging a shred of viability, but even it can't carry this dead weight. The pinnacle of your strategic genius, however, is undoubtedly Dragonair. What exactly is the plan here? Are you hoping Cynthia will be so offended by your NFE Pokémon that she forfeits? Or are you aiming for a 'Spirit of Evolution' award? You wouldn't survive past Volkner's Electivire, let alone her Garchomp, with this lineup. This isn't National Dex, it's a National Disgrace.",
    "worst_pokemon": "dragonair"
  },
  {
    "team": [
      "alakazam",
      "ampharos",
      "alakazam",
      "abra",
      "aerodactyl",
      "ampharos"
    ],
    "roast": "Oh, you're a 'veteran,' huh? If by 'veteran' you mean you've played *one* game and only ever used a trade cord, then maybe. Two Alakazams and two Ampharos? Original. Then you capped off this masterpiece of strategic depth with an *Abra* and an Aerodactyl. Congratulations, you've assembled a team that makes Whitney's Miltank look like a tactical genius. Let's be real: that Abra is going to get absolutely eviscerated by literally anything faster than a snail, which is everything. Your Alakazams will be Karen's punching bags, and don't even *think* about showing this electric-psychic fan club to Lance's Dragonites. You have zero answers for Dragon, Grass, Water, or Steel types, and Jasmine's Steelix is going to wall you harder than Red at the peak of Mount Silver. This isn't a team; it's a speedrun of how many times you can white out.",
    "worst_pokemon": "abra"
  },
  {
    "team": [
      "swampert",
      "altaria",
      "ninetales",
      "aggron",
      "rayquaza",
      "gyarados"
    ],
    "roast": "Alright, let's take a look at this 'masterpiece' for Ruby, Sapphire, or Emerald. I'm guessing Emerald, since you seem keen on making the Battle Frontier a living hell for yourself. First off, Rayquaza. Seriously? Did you just go 'ooh, big green dragon, good for team!'? That's not a strategy, that's just being lazy. It’ll get you through the main game, sure, but try bringing that to the Battle Tower against a Palmer with a Regigigas and tell me how your 'skill' holds up. Most facilities outright ban legendaries like that, leaving you with five Pokémon and a massive hole in your 'plan'. Now, for the actual Pokémon: Swampert is solid, good typing, but anything Grass-type immediately ends its career. Gyarados with Intimidate is great, but that 4x Electric weakness? Wattson would have been a joke for Swampert, but the Frontier has Electrics that will one-shot your big fish without breaking a sweat. And Aggron? High defense, sure, but you're just begging for a Guts Machamp or an Earthquake to turn it into scrap metal. That 4x Fighting and Ground weakness is a glaring billboard advertising 'EASY KNOCKOUT'. But the real head-scratcher here, the absolute low point of this 'team', is Ninetales. Ninetales! Why? Its stats are mediocre, its movepool in Gen 3 is a joke, and it contributes virtually nothing that a Blaziken, Arcanine, or even a freakin' Torkoal couldn't do better. You've got an objectively terrible Fire-type when Hoenn has so many better options. You're going to get absolutely bodied by Glacia’s Walrein with this excuse for a Fire-type, and Drake's dragons will laugh as they sweep your entire squad. This isn't a team; it's a random assortment of 'cool-looking' Pokémon and a legendary crutch. You're going to crash and burn faster than a Magikarp against an Electric-type.",
    "worst_pokemon": "Ninetales"
  },
  {
    "team": [
      "feraligatr",
      "jolteon",
      "garchomp",
      "dragonair",
      "lucario",
      "charizard-mega-x"
    ],
    "roast": "Are you absolutely kidding me with this garbage? Dragonair?! Seriously? You've got a damn pre-evolution on a team with a Mega Charizard X and Garchomp. That's not a team, that's a playground fantasy. Feraligatr and Jolteon are fine for the local park, but they're utterly outclassed here, and Lucario is just... there. This isn't competitive, this is a joke. Get your act together or just stick to playing solo, because you're clearly not ready for anything beyond the first gym.",
    "worst_pokemon": "dragonair"
  },
  {
    "team": [
      "garchomp",
      "feraligatr",
      "jolteon",
      "lucario",
      "charizard-mega-x",
      "dragonair"
    ],
    "roast": "Are you absolutely kidding me with this amateur hour garbage? You've got some decent threats here and then you throw in a *Dragonair*? What, did your mom tell you it was cute and you just had to bring it? This isn't daycare, this is competitive Pokemon, and you're bringing an unevolved paperweight. The rest of your team has zero synergy and is full of redundant types. Get out of here.",
    "worst_pokemon": "dragonair"
  },
  {
    "team": [
      "feraligatr",
      "charizard",
      "dragonair",
      "lucario",
      "jolteon",
      "garchomp"
    ],
    "roast": "Are you serious with this garbage? Did you just evolve half your team and then run out of Rare Candies for the rest? Bringing a Dragonair to a competitive battle is like showing up to a gunfight with a half-broken squirt gun. This team is an absolute joke, clearly built by someone who thinks 'cute' wins battles. You've got no coherent strategy, huge weaknesses to anything with Ice, and frankly, I'm offended you even tried to call this a 'team'. Pathetic.",
    "worst_pokemon": "dragonair"
  },
  {
    "team": [
      "bulbasaur",
      "raichu",
      "kakuna",
      "seadra",
      "venomoth",
      "tentacruel"
    ],
    "roast": "Are you seriously trying to pass this off as a team? Kakuna? BULBASAUR? Seadra? What, did you just forget about evolution stones and leveling up? This is a collection of unevolved dead weight and type redundancies that screams 'I just started playing five minutes ago.' That Psychic weakness is a Grand Canyon, and your 'strategy' seems to be praying your opponent forfeits out of sheer pity. This is an embarrassment.",
    "worst_pokemon": "kakuna"
  },
  {
    "team": [
      "feraligatr",
      "lucario",
      "charizard-mega-x",
      "jolteon",
      "garchomp",
      "dragonair"
    ],
    "roast": "Are you absolutely joking with this team? It's a collection of decent offensive threats glued together with a wet noodle and an unevolved paperweight. Three dragons means any Ice-type will run through you like a hot knife through butter. Your 'strategy' seems to be 'hit hard and pray' because you have zero defensive synergy. And Dragonair? Seriously? That thing couldn't sweep a dust bunny, let alone a competitive battle. This isn't a team, it's a daycare lineup for toddlers.",
    "worst_pokemon": "dragonair"
  },
  {
    "team": [
      "feraligatr",
      "lucario",
      "charizard",
      "jolteon",
      "garchomp",
      "dragonair"
    ],
    "roast": "This team is an absolute joke, seriously. Did you even *try* to evolve your Pokémon, or are you just actively trying to lose? Putting an unevolved Dragonair on a competitive team is so laughably bad it's insulting. And Charizard without a Mega Stone? What a waste, just sitting there waiting for Stealth Rock to obliterate it. You've got some good Pokémon in Garchomp and Feraligatr, but they're completely dragged down by the sheer incompetence evident in the rest of this 'lineup.'",
    "worst_pokemon": "dragonair"
  }
]